# 1. Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.
#
# num = input("Введите число: ")
#
# count = 1
#
# for i in range(int(num)):
#     print(count, end=" ")
#     count *= -3

# 2. Создать список, длины n, значения формируются по формуле 3k + 1,
#    где k принимает значения от 1 до n включительно.
#
# num = input("Введите число: ")
#
# result = []
# for i in range(1, int(num)+1):
#     result.append(3*i+1)
#
# print(result)

# 3. Напишите программу, в которой пользователь будет задавать две строки,
#    программа - определять количество вхождений одной строки в другой.

# str1 = input("Введите строку 1: ")
# str2 = input("Введите строку 2: ")
# 
# print(str1.count(str2))
